# DividedSurfaceDisplayGridlines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceDisplayGridlines Property
ParameterTypeId Class See Also
---
"Gridlines"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceDisplayGridlines { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceDisplayGridlines As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceDisplayGridlines {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace